yangminglong/WirelessFocStepperDriver/code/wake_sender/sdkconfig.defaults
# ---- 目标 ----
CONFIG_IDF_TARGET="esp32c6"

# ---- BT / NimBLE: 只需要 broadcaster ----
# C6 无经典蓝牙, 没有(也不需要) BTDM_CTRL_MODE_* 系列符号。
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_MAX_PERIODIC_SYNCS=1

# ---- 低功耗 (发射端) ----
# ⚠️ C6 用的是**新**控制器符号 BT_LE_* (不是 C3 的 BT_CTRL_*)。
#    写错不会报错, 会被 Kconfig 静默忽略 —— 本工程踩过这个坑。
# 32.768kHz 晶振是 PA 的硬前提。板上若无晶振, 只能退到 MAIN_XTAL
# (实测代价 +3.33 mA, 见 tests/ble_sync/docs/02 §1.3)。
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y

# PM + tickless: 广播事件之间可以让 CPU 睡
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# ---- 控制台: UART0 ----
# 不用原生 USB-Serial-JTAG: 经 USJ 的复位会让 ROM 进下载模式,
# 且 USJ 不支持轻睡 (IDF-6395)。
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n
